x = str(input("у вас мальчик или девочка?"))
if x == "мал":
    c = int(input("сколько лет????"))
    if c <= 5:
        print("развитие ума")
        v = str(input("лит или матем"))
        if v == "лит":
            print("значит литра")
            m = str(input("спокойный или буйный?"))
            if m == "спок":
                print("вам в какуй нибудь секцию")
                l = str(input("художка или лепка"))
                if l == "худ":
                    print("значит художка")
                if l == "леп":
                    print("значит лепка")
            if m == "буйн":
                print("он будет бездарем, отведи его в дурку")
        if v == "матем":
            print("значит математика")
            m = str(input("спокойный или буйный?"))
            if m == "спок":
                print("вам в какуй нибудь секцию")
                l = str(input("художка или лепка"))
                if l == "худ":
                    print("значит художка")
                if l == "леп":
                    print("значит лепка")
            if m == "буйн":
                print("он будет бездарем, отведи его в дурку")



    

    
    if c >= 5 and c <= 10:
        print("физическая сила")
        v = str(input("сильный или слабый"))
        if v == "сил":
            print("физическая сила")
            m = str(input("боевые искуства или лёгк атлетика?"))
            if m == "б и":
                print("значит вам в боевую секцию")
                
            if m == "л а":
                    print("значит лёгк атлетика")
                
        if v == "слаб":
                print("отдай его в качалку")








    if c >= 10 and c <= 15:
        print("умств способ")
        v = str(input("умный или тупой"))
        if v == "ум":
            print("11 клас")
            m = str(input("коледж или институт?"))
            if m == "ко":
                print("значит вам в коледж")
                
            if m == "ин":
                    print("значит вам в институт")
                
        if v == "ту":
                print("иди работай дворником")
    
        
  





if x == "дев":
    c = int(input("сколько лет????"))
    if c <= 5:
        print("развитие ума")
        v = str(input("лит или матем"))
        if v == "лит":
            print("значит литра")
            m = str(input("спокойная или буйная?"))
            if m == "спок":
                print("вам в какуй нибудь секцию")
                l = str(input("художка или лепка"))
                if l == "худ":
                    print("значит в художка")
                if l == "леп":
                    print("значит в лепка")
            if m == "буйн":
                print("она будет бездарем, отведи его в дурку")
        if v == "матем":
            print("значит математика")
            m = str(input("спокойная или буйная?"))
            if m == "спок":
                print("вам в какуй нибудь секцию")
                l = str(input("художка или лепка"))
                if l == "худ":
                    print("значит художка")
                if l == "леп":
                    print("значит лепка")
            if m == "буйн":
                print("она будет бездарем, отведи его в дурку")









    if c >= 5 and c <= 10:
        print("физическая сила")
        v = str(input("сильная или слабая"))
        if v == "сил":
            print("физическая сила")
            m = str(input("боевые искуства или лёгк атлетика?"))
            if m == "б и":
                print("значит вам в боевую секцию")
                
            if m == "л а":
                    print("значит лёгк атлетика")
                
        if v == "слаб":
                print("отдай её в качалку")











    if c >= 10 and c <= 15:
        print("умств способ")
        v = str(input("умная или тупая"))
        if v == "ум":
            print("11 клас")
            m = str(input("коледж или институт?"))
            if m == "ко":
                print("значит вам в коледж")
                
            if m == "ин":
                    print("значит вам в институт")
                
        if v == "ту":
                print("иди работай техничкой")







    
